Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/the_asylum_process_in_ireland/applying_for_refugee_status_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Applying for international protection in Ireland
ga: Ag cur isteach ar stádas dídeanaithe

source: The International Protection Act 2015, which came into effect on 31 December 2016, provides for a single application procedure for international protection. It replaces the earlier system, under which several applications could have been made
ga: Faoi Acht na nDídeanaithe 1996, arna leasadh ag alt 11(1) den Acht Inimirce 1999, agus ag alt 9 d’Acht na nInimirceach Mídhleathach (Gáinneáil) 2000, agus ag alt 7 den Acht Inimirce 2003; pléifear le d’iarratas ar dhearbhú mar theifeach:

source: Under the Act, a person who qualifies for international protection is “a person who is either—
ga: • Agus ar deireadh, bunaithe ar mholadh Choimisinéir Iarratais na nDídeanaithe nó Bínse Achomhairc na nDídeanaithe, is ea a ghlacfaidh an tAire Dlí agus Cirt agus Comhionannais le cinneadh

source: (a) a refugee and in relation to whom a refugee declaration is in force, or
ga: Féadann tú iarratas a dhéanamh ar dhearbhú mar theifeach ag an bport iontrála

source: (b) a person eligible for subsidiary protection and in relation to whom a subsidiary protection declaration is in force”
ga: Féadann tú d’iarratas ar dhearbhú mar theifeach a dhéanamh freisin ag Oifig Choimisinéir Iarratais na nDídeanaithe

source: • At first instance, it will be handled by the International Protection Office (IPO), which will make a recommendation in relation to your case
ga: Fochosanta: Faoi na Rialacháin na hAontais Eorpaigh (Fochosanta) (Leasú) 2015, má dhéanann tú iarratas ar stádas dídeanaithe, is féidir iarratas ar fhochosanta (pdf) chuig Oifig an Choimisinéara Iarratais do Dhídeanaithe a dhéanamh freisin

source: • If the recommendation is negative and you are entitled to appeal, any such appeal will be dealt with by the International Protection Appeals Tribunal
ga: Chomh maith le sin, má tá iarratas ar stádas dídeanaithe agat, is féidir iarratas ar fhochosanta a dhéanamh

source: • Finally, based on the recommendation of the International Protection Office or the International Protection Appeals Tribunal, the Minister for Justice and Equality will decide whether to give you a refugee declaration; give you a subsidiary protection declaration; or refuse your application
ga: Athruithe ar an dlí ar inimirce

source: You may make an application for international protection at the port of entry
ga: Soláthraíonn an tAcht um Chosaint Idirnáisiúnta 2015:

source: You may also make your application for international protection at the International Protection Office
ga: • Aistreofar próiseáil iarratas cosanta ón Oifig an Choimisinéara Iarratais do Dhídeanaithe chuig an Roinn Dlí agus Cirt agus Comhionannais

source: This section outlines the procedure to be followed in each case
ga: • Bunú Binse Achomhairc Cosanta Idirnáisiúnta neamhspléach Rialacha

source: You can read more in this information note on applications for international protection available on ipo.gov.ie
ga: Má chuireann tú in iúl gur mian leat a chur isteach ar thearmann, iarrfar ort foirm iarratais a chomhlánú ar dhearbhú mar theifeach

source: Transitional arrangements will apply to certain applications for international protection that were made before the commencement date of the International Protection Act 2015, for the completion of processing under the Act
ga: Más mian leat iarratas ar leithligh a dhéanamh ar son do leanaí mionúra (nó cleithiúna(í/ithe)), ní foláir foirm iarratais ar leith do dhearbhú a chomhlánú do gach leanbh mionúr (nó cleithiúnaí)

source: Whether you are at the port of entry, or are already in the State and applying at the International Protection Office, you will first be interviewed by an immigration officer or an international protection officer
ga: Ní mór aon bhuncháipéisí taistil (pasanna, laissez-passer) a bhfuil tú ina seilbh a bheith i dteannta d’iarratais, agus más iomchuí, cinn do leanaí faoi bhun 18 bliain aois

source: This preliminary interview is to establish whether you wish to make an application for international protection and if so, to find out the general grounds upon which the application is based; your identity, nationality and country of origin; the method of your entry (that is, the mode of transport used and the route you travelled) into the State; the reason why you are in the State; the legal basis for your presence in the State; and whether your application is inadmissible, either because you have been granted international protection in another EU state or because a non-EU state is your first country of asylum
ga: Mura bhfuil cúis réasúnta agat gan é a dhéanamh, ní mór duit bunchóipeanna de gach cáipéis aitheantais, teastas breithe agus pósta i do sheilbh a sholáthar a bhaineann leatsa agus/nó le do leanaí mionúra (nó cleithiúna(í/ithe))

source: You will be asked to complete an application form for international protection
ga: Cuirfear faoi agallamh tosaigh tú, de réiralt 8 d’Acht na nDídeanaithe 1996, arna leasaithe, chun a bhunú an mian leat iarratas a dhéanamh ar dhearbhú, agus más amhlaidh, chun na forais ghinearálta a fháil amach ar a mbíonn an t-iarratas bunaithe; d’aitheantas, náisiúntacht agus tír bhunaidh, modh d’iontrála (is é sin, an modh iompair a úsáideadh agus an chonair/treo ar ar thaistil tú) isteach sa stát; bonn dlíthiúil do láithreachta sa stát agus aon fhaisnéis bhunúsach eile a theastaíonn ón gCoimisinéir Iarratais do Dhídeanaithe

source: If you have applied for international protection, your accompanying minor children will be included in your application and all decisions taken in relation to your international protection application will apply to them
ga: Tabharfar comhairle duit ag deireadh d’agallaimh faoi do cheart chun cúnamh dlíthiúil a lorg agus chun dul i gcomhairle le hArd-Choimisinéir na Náisiún Aontaithe do Theifigh (UNHCR)

source: When your application is received you will be given a written statement informing you of the procedures for examining your application; your right to seek legal assistance and your right to an interpreter
ga: Má chuir thú isteach ag an bport iontrála ní mór duit freastal ar oifig Choimisinéir Iarratais do Dhídeanaithe chun an próiseas tosaigh thearmainn a chríochnú

source: You will also be informed of your obligations as an applicant for international protection
ga: Mura ndéanann tú amhlaidh agus nach soláthraíonn tú seoladh chuig an gCoimisinéir laistigh de 5 lá oibre ó dhéanamh an iarratais, measfar d’iarratas a bheith aistarraingthe

source: As part of the process, you and your dependent minors will be required to have your photographs taken
ga: Mar chuid den phróiseas, beidh ort féin agus ar do mhionúir chleithiúnacha bhur ngrianghraf a tharraingt

source: You will also be required to have your fingerprints taken
ga: Beidh ort freisin do méarlorg a thabhairt

source: Fingerprints of your dependent minors may also be taken
ga: Féadfar meárlorg do mhionúr cleithiúnach a thabhairt freisin

source: Your fingerprints may be disclosed in confidence to the relevant Irish authorities and to asylum authorities of other countries, which may have responsibility for considering your application under the Dublin III Regulation (an electronic system – Eurodac – facilitates transfer of fingerprint information between Dublin III Regulation countries)
ga: Féadfar bhur méarlorg a nochtadh de rún chuig na húdaráis Éireannacha ábhartha agus chuig údaráis thíortha eile, ag a bhféadfadh freagracht a bheith as d’iarratas a bhreithniú faoi Rialachán Bhaile Átha Cliath III (éascaíonn córas leictreonach – Eurodac – aistriú na faisnéise méarloirg idir tíortha Rialachán Bhaile Átha Cliath III)

source: If you refuse to allow your fingerprints to be taken, you will be deemed not to have made reasonable effort to establish your true identity and to have failed in your duty to co-operate in the investigation of your application
ga: Má dhiúltaíonn tú do mhéarlorg a thabhairt, measfar nach ndearna tú iarracht réasúnta chun d’fhíor-aitheantas a bhunú agus gur theip ort do dhualgas chun comhoibriú i bhfiosrúchán d’iarratais a chomhlíonadh

source: This may affect the credibility of your application and lead to your application being withdrawn in which case the Minister for Justice shall refuse to give you a declaration
ga: D’fhéadfadh sé seo cur isteach ar chreidiúnacht d’iarratais agus d’fhéadfaí d’iarratas a aistharraingt, agus sa chás sin diúltóidh an tAire do dhearbhú a thabhairt duit

source: You should also note that, under section 20 (1) of the International Protection Act 2015, where an immigration officer or a member of the Garda Síochána, with reasonable cause, suspects that an applicant has not made reasonable effort to establish their identity, they may detain the person concerned
ga: Ba chóir duit a thabhairt faoi deara freisin go bhféadfadh ball den Gharda Síochána, de réir alt 9(8)(c), mar a mbíonn siad amhrasach, le cúis réasúnta, faoi iarratasóir nach ndearna sé nó sí iarracht réasúnta a (h)aitheantas a bhunú; go bhféadfaidís an duine i gceist a choinneáil

source: You will be given permission to remain in the State while your application is being examined and you will be issued with a temporary residence certificate setting out your personal details and containing your photograph
ga: Tabharfar ceistneoir duit, nach mór duit a chomhlánú agus a chur ar ais ag dáta agus am sonraithe ag an gCoimisinéir Iarratais do Dhídeanaithe

source: The temporary residence certificate is an immigration registration certificate, and you will have to produce it if you are asked to do so at any time by an immigration officer or a member of the Garda Síochána
ga: Breithneofar an fhaisnéis a sholáthraíonn tú i do cheistneoir le measúnú d’iarratais. Bíonn sé tábhachtach, dá réir sin, go dtabharfá freagraí iomlána fírinneacha ar gach ceist

source: When you have received your temporary residence certificate you will be referred to the Reception and Integration Agency, which will arrange for you to be taken to a reception centre in the Dublin area
ga: Eiseofar Teastas um Chónaitheacht Shealadach leat sula bhfágann tú an tAonad Fáiltithe ag Oifig Choimisinéir Iarratais do Dhídeanaithe; ag leagan amach do mhionsonraí pearsanta agus ar a mbeidh do ghrianghraf

source: You will remain there for a short period while your needs are assessed
ga: Ní cáipéis aitheantais é an Teastas um Chónaitheacht Shealadach

source: You will then be relocated to accommodation, which may be outside Dublin, and where you will be expected to stay while your application for international protection is being processed
ga: Athlonnófar tú ansin chuig lóistín, a d’fhéadfadh a bheith lasmuigh de Bhaile Átha Cliath agus mar a mbeifear ag dúil go bhfanfaidh tú ann a fhad agus a bhíonn d’iarratas ar dhearbhú á phróiseáil

source: A child under the age of 18 arriving at the frontiers of the State (port of entry) or at the International Protection Office and who is not in the custody of an adult, will be referred to the Child and Family Agency (Tusla)
ga: Aon leanbh faoi bhun aois 18 a thagann ag críocha an Stáit (An Port Iontrála) nó ag Oifig Choimisinéir Iarratais do Dhídeanaithe, agus nach bhfuil faoi chúram duine fásta, cuirfear faoi bhráid na Gníomhaireachts um Leanaí agus an Teaghlach iad

source: The Agency may then decide that an application for international protection should be made on behalf of the minor
ga: Féadann an Ghníomhaireacht a chinneadh ansin gur chóir iarratas ar dhearbhú mar theifeach a dhéanamh ar son an mhionúir

source: Specific arrangements will be made by the Child and Family Agency in conjunction with the International Protection Office for the processing of such an application
ga: Déanfaidh an Ghníomhaireacht socrúcháin shonracha i gcomhpháirt le hOifig Choimisinéir Iarratais do Dhídeanaithe do phróiseáil an iarratais sin

source: The Child and Family Agency is responsible for the general care and well being of the minor and will provide assistance to that minor
ga: Bíonn freagracht ag an Ghníomhaireacht as cúram ginearálta agus leas an mhionúir agus tabharfaidh siad cúnamh don mhionúr sin

source: Under Section 73 of the International Protection Act 2015, the Minister for Justice and Equality may decide that certain classes of applications are to be dealt with as a priority
ga: Féadann an tAire treoir a thabhairt i scríbhinn chuig an gCoimisinéir nó an Bínse nó chucu araon faoina dteastaíonn go bpléifí le haicmí áirithe iarratais mar thosaíocht

source: • Whether the applicant possesses identity documents, and, if not, whether they have provided a reasonable explanation for the absence of such documents
ga: Sa chás go gclúdaíonn a leithéid de threoir d’iarratas, cuirfear comhairle ort faoi sin

source: • Whether the applicant has provided a reasonable explanation to substantiate their claim that the State is the first safe country in which they have arrived since departing from their country of origin
ga: Féadfar treoir Aireachta den chineál seo a chinneadh trí thagairt do cheann amháin nó níos mó de na hábhair seo a leanas:

source: • Whether the applicant has provided a full and true explanation of how they travelled to and arrived in the State
ga: • Forais na n-iarratas faoi alt 8 d’Acht na nDídeanaithe 1996, arna leasaithe;

source: • Where the applicant has forged, destroyed or disposed of any identity or other documents relevant to their application, whether they have a reasonable explanation for so doing
ga: • Tír bhunaidh nó ghnáthchónaí na n-iarratasóirí;

source: • Whether the applicant has adduced manifestly false evidence in support of their application, or has otherwise made false representations, either orally or in writing
ga: • Aon ghaol teaghlaigh idir iarratasóirí;

source: • Whether the applicant has cooperated with the application process, as required under section 27(1) of the Act
ga: • Aoiseanna na n-iarratasóirí agus, go háirithe de na daoine faoi bhun aois 18 a ndéantar iarratais ina leith;

source: • Whether the applicant is a person in respect of whom the Child and Family Agency (Tusla) is providing care and protection
ga: • Na dátaí ar a ndearnadh na hiarratais;

source: On 27 February 2017, the International Protection Office published details of how certain classes of application are to be prioritised (pdf)
ga: • Breithnithe faoin tslándáil náisiúnta nó faoin mbeartas poiblí;

source: Most applications will be scheduled for interview in the main processing stream on the basis of “oldest cases first”
ga: • An dóchúlacht go mbíonn bunús maith ag na hiarratais;

source: However, certain cases will be prioritised in a separate processing stream, based on the following criteria:
ga: • Má bhíonn cúinsí speisialta ann maidir le leas na n-iarratasóirí nó leas bhaill theaghlaigh na n-iarratasóirí;

source: • Whether the applicant is an unaccompanied minor in the care of the Child and Family Agency (Tusla)
ga: • An dtaispeánann na hiarratais ar a n-aghaidh na forais don áitiú gur teifeach is ea an t-iarratasóir;

source: • Whether the applicant applied as an unaccompanied minor, but has now aged out
ga: • An ndearna na hiarratasóirí léiriúcháin bhréagacha nó míthreoracha i ndáil lena n-iarratais;

source: • Whether the applicant is over 70 years of age and is not part of a family group
ga: • Ar chuir na hiarratasóirí isteach iarratais roimhe sin ar thearmann i dtír éigin eile;

source: • Whether the applicant has notified the IPO since 31 December 2016 that a medico-legal report, indicating likely well-foundedness, has been submitted
ga: • An ndearnadh na hiarratais faoi alt 8 d’Acht na nDídeanaithe 1996, arna leasaithe, ag an deis ba luaithe tar éis a dteacht isteach sa Stát;

source: • Whether the application is likely to be well-founded due to the country of origin or habitual residence of the applicant
ga: • An náisiúnaigh de chuid tír bhunaidh iad na hiarratasóirí, nó an bhfuil ceart cónaithe acu sa tír sin atá ainmnithe mar thír shábháilte faoi alt 12(4) d’Acht na nDídeanaithe 1996, arna leasaithe;

source: • Whether the applicant has notified the IPO since 31 December 2016 that evidence has been submitted, certified by a medical consultant, of an ongoing severe/life-threatening medical condition
ga: • Más duine é an t-iarratasóir a bhfeidhmíonn mír (a), (b) nó (c) d’alt 2 d’Acht na nDídeanaithe 1996, arna leasaithe, chucu

source: The International Protection Office has published a detailed information booklet for applicants for international protection (pdf)
ga: • Achomhairc ó iarratasóirí i ndáil le moltaí ón gCoimisinéir a thiteann laistigh de na catagóirí a gcuirtear síos orthu in alt 13(6) cinneadh agus alt 13(8) den Acht
